# OptionalFunctionalityNotAvailableException Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
OptionalFunctionalityNotAvailableException Class
Members See Also
---
The exception that is thrown when the optional functionality is not available in the installed Revit
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
[SerializableAttribute]
public class OptionalFunctionalityNotAvailableException : InvalidOperationException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class OptionalFunctionalityNotAvailableException _
	Inherits InvalidOperationException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class OptionalFunctionalityNotAvailableException : public InvalidOperationException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..InvalidOperationException Autodesk.Revit.Exceptions..::..OptionalFunctionalityNotAvailableException
# See Also
OptionalFunctionalityNotAvailableException Members
Autodesk.Revit.Exceptions Namespace